export const getReleaseNotes = () => {
  return [...releaseNotes].reverse();
}

export const releaseNotes = [
  {
    date: '2024-8-21',
    title: 'β版リリースのお知らせ',
    content: `この度、STRIKER BASE β版がついにリリースされました！🎉

このサイトは、すべてのストライカーがもっと楽しくゲームをプレイできるように、いろいろなツールや情報をお届けすることを目指しています。
現在ご利用いただける機能は以下の通りです：

- スピード調整ツール
わくわくの実を使ったモンスターのスピード調整を簡単に行えます。

- ランク&経験値計算ツール
入力された情報をもとに、目標ランクや目標経験値までの道筋を立てるお手伝いをします。

「これがあればもっと便利だな」というご要望にお応えし、ストライカーの皆さまを全力でサポートします。

ただし、β版のため、もしかすると不具合が発生するかもしれません。
何かしらの問題を見つけたら、サイト下部のXアカウントまでご連絡いただけますと幸いです。
皆さまからのフィードバックを心よりお待ちしています。

これからも、STRIKER BASEをよろしくお願いいたします。

--------------------------------
STRIKER BASE 開発担当
よしちゃぽ

`,
  },
  {
    date: '2024-8-21',
    title: 'アプリのインストールについてのお知らせ',
    content: `STRIKER BASEはPWA（プログレッシブウェブアプリ）モードに対応しています！\n\n以下の手順でホーム画面に追加し、アプリのようにご利用いただけます：

- **iOSの方：**\n  1. SafariでSTRIKER BASEを開きます。\n  2. 画面下部の共有アイコンをタップします。\n  3. 「ホーム画面に追加」を選択してください。

- **Androidの方：**\n  1. ChromeでSTRIKER BASEを開きます。\n  2. 画面右上のメニューアイコンをタップします。\n  3. 「ホーム画面に追加」を選択してください。

この方法で、手軽にSTRIKER BASEを利用することができます。

引き続き、皆さまからのフィードバックをお待ちしています！

--------------------------------
STRIKER BASE 開発担当
よしちゃぽ

`,

  },
  {
    date: '2024-8-21',
    title: '開発中の機能についてのお知らせ',
    content: `こんにちは、今後のSTRIKER BASEの開発予定についてお知らせいたします。

現在、さらなる利便性向上のために新しい機能の開発を進めています。
皆さんの「こんな機能があったらいいな！」という声にお応えするべく、現在取り組んでいるのは以下の機能です：

- パーティ編成ツール
パーティ編成を手軽に共有できるツールです。(使用モンスター、わくわくの実、魂の紋章etc)
画像やステータス等、データの利用について調整を実施予定です。

- EXログ
EXクエスト周回の軌跡を記録し、ストライカーとしての成長・思い出を振り返ることができます。

これらの新機能で、皆さんのストライカー人生がさらに充実することを願っています。
アップデート情報については、随時お知らせしてまいりますので、お楽しみに！

これからも、STRIKER BASEをよろしくお願いいたします。

--------------------------------
STRIKER BASE 開発担当
よしちゃぽ

`,
  },
];